<h2>このチュートリアルのねらい:</h2>

<li>モデル - ビュー - コントローラの基本</li>
<li>ルーティングの基本</li>
<li>フォームバリデーション</li>
<li>“Query Builder” を利用した基本的なデータベースクエリの実行</li>
<p>チュートリアル全体は複数のページに分割されています。 各々が CodeIgniter フレームワークの機能のごく一部を説明をします。 あなたには次のページを読んで頂きます:
</p>

<li>はじめに、 このページはチュートリアルの全体像を説明しています。</li>
<li>静的ページ 、コントローラ、ビューとルーティングの基本について お教えします。</li>
<li>ニュースセクション 、モデルを使い始め、 いくつかの基本的なデータベース操作を行います。</li>
<li>ニュース記事の作成 、 高度なデータベース操作やフォームバリデーションをご紹介します。</li>
<p>おわりに 、次に読むべき資料やその他のリソースへの いくつかのポインタを与えます。
CodeIgniter フレームワークの探求をお楽しみください。</p>